Repository: majidnazari65/wp-telegram-poster
Catalog: languages/wp-telegram-poster-*.po
Languages: fa_ir

source: Send to Telegram
fa_ir: ارسال به تلگرام

source: Unauthorized
fa_ir: غیرمجاز

source: Post is not published
fa_ir: پست منتشر نشده است

source: Plugin settings not configured
fa_ir: تنظیمات افزونه پیکربندی نشده است

source: Failed to send to worker:
fa_ir: ارسال به ورکر ناموفق بود:

source: Sent to Telegram via worker
fa_ir: از طریق ورکر به تلگرام ارسال شد

source: Worker error:
fa_ir: خطای ورکر:

source: WP Telegram Poster Settings
fa_ir: تنظیمات افزونه تلگرام پوستر

source: WP Telegram Poster
fa_ir: تلگرام پوستر وردپرس

source: Adds a button to publish WordPress posts to Telegram via a Cloudflare Worker
fa_ir: اضافه کردن دکمه ارسال به تلگرام در نوشته‌ها، برگه‌ها و سایر پست تایپ‌ها بدون نیاز به سرور خارج از ایران

source: Configuration
fa_ir: پیکربندی

source: Secret Key
fa_ir: کلید مخفی

source: Cloudflare Worker URL
fa_ir: آدرس ورکر کلادفلر

source: Telegram Chat ID
fa_ir: شناسه چت تلگرام

source: Enter the Telegram Chat ID (e.g., @YourChannel or a group ID).
fa_ir: شناسه چت تلگرام را وارد کنید (مانند @YourChannel یا شناسه گروه).

source: Enter the cloudflare worker url.
fa_ir: آدرس ورکر کلادفلر را وارد کنید.

source: Enter the secret key. this secret key must used in cludflare worker envirounment valiables.
fa_ir: کلید مخفی (Secret Key) را وارد کنید. این کلید باید در ورکر کلادفلر در قسمت Envirounment valiables ایجاد شود.

source: Read More Button Text
fa_ir: متن دکمه بیشتر بخوانید

source: Text for the Read More button in Telegram messages.
fa_ir: متن دکمه بیشتر بخوانید در پیام‌های تلگرام.

source: Enter the secret key, Cloudflare Worker URL, Telegram Chat ID, and Read More button text to connect WordPress to your Telegram bot.
fa_ir: کلید مخفی، آدرس ورکر کلودفلر، شناسه چت تلگرام و متن دکمه بیشتر بخوانید را برای اتصال وردپرس به ربات تلگرام خود وارد کنید.
